Repository: Haidar0096/Image-Editor-Desktop
Catalog: lib/l10n/app_*.arb
Languages: ar

# welcomeText
source: Welcome To School Activities App
ar: أهلا بك الى تطبيق الأنشطة المدرسية

# continueText
source: continue
ar: متابعة

# homeScreenTitle
source: Home Screen
ar: الصفحة الرئيسية

source: Edit Image
ar: تعديل صورة

source: Settings
ar: الاعدادات

# settingsScreenTitle
source: Settings
ar: الاعدادات

source: Change Language
ar: تغيير اللغة

source: language
ar: اللغة

# errorScreenText
source: An error has occurred, please contact the developer.
ar: حدث خطأ ما، رجاء تواصل مع مطور البرنامج

# editImageScreenTitle
source: Edit Image
ar: تعديل صورة

source: Add Image
ar: إضافة صورة

source: Add Static Text
ar: إضافة نص ثابت

# typeText
source: Type the text here (Double tap to start):
ar: أدخل النص (انقر مرتين للبدأ)

source: Add Variable Text
ar: إضافة نص متغير

source: Save
ar: حفظ

source: Done
ar: تم

source: Bring to front
ar: إحضار إلى المقدمة

source: Remove Element
ar: إزالة العنصر

source: File
ar: الملف

source: Generate
ar: توليد

source: About
ar: حول

source: Coming Soon
ar: آت قريبا

# appName
source: Image Editor
ar: برنامج تعديل الصور

source: Press anywhere to go back.
ar: اضغط في أي مكان للرجوع

# errorHasOccurred
source: An error has occurred.
ar: حدث خطأ ما.

source: Clear Editor
ar: محو كل شيء

source: Properties
ar: الخصائص

source: File Name
ar: اسم الملف

source: Show Order
ar: مستوى الظهور

source: Size
ar: الحجم

source: Choose an element to see its properties.
ar: اخنر عنصرا لتر خصائصه.

source: Reset Size
ar: اعادة الحجم

source: Edit Text
ar: تعدبل النص

source: Make Text Larger
ar: تكبير الخط

source: Make Text Smaller
ar: تصغير الخط

source: Font Size
ar: حجم الخط

source: Change Color
ar: تغيير اللون

source: Generated text appears here.
ar: النص المتولد سيظهر هنا.

# love
source: ❤ This app is dedicated to my love, Mom, JE T'AIME ❤
ar: ❤ هذا التطبيق مهدى الى روحي و قلبي، أحبك أمي ❤

# featureComingSoon
source: This feature is coming soon!
ar: هذه الميزة آتية قريبا!

source: OK
ar: حسنا

source: Deselect
ar: الغاء الاختيار

source: Font Family
ar: الخط

source: Choose variable text source file.
ar: اختيار ملف النص المتغير

# processStart
source: Process started
ar: بدء المعالجة

source: Cancel
ar: إلغاء

# operationSuccess
source: Operation Successful!
ar: تمت العملية بنجاح!

# operationFailure
source: Operation Failed!
ar: فشلت العملية!

source: Operation Canceled!
ar: تم إلغاء العملية!

source: Generate Image Settings
ar: إعدادات توليد الصورة

source: File Naming Type
ar: نوع تسمية الملف

source: Base File Name
ar: اسم الملف الأساسي

source: Width
ar: العرض

source: Height
ar: الطول

# quality
source: Quality (Only in case of JPEG)
ar: الجودة (فقط في حالة JPEG)

source: No directory selected
ar: لم يتم اختيار مكان الحفظ

source: Directory must be set.
ar: يجب تحديد مكان الحفظ

source: Base file name must be set.
ar: يجب تحديد اسم الملف الأساسي

# baseFileNameMustBeAlphaNumeric
source: Only lower case letters, upper case letters, numbers, and underscores are allowed in the base file name.
ar: يجب أن يحتوي اسم الملف الأساسي على حروف و أرقام فقط، و يسمح أيضا يوضع الرموز الآتية: _

# someTextsHaveNoSourceFile
source: Some texts have no source file. All variable texts must have a source file.
ar: بعض النصوص ليس لديها ملف مصدر، يجب على كل النصوص أن يكون لها ملف مصدر.

# someTextsHaveDifferentLineCount
source: Some texts have different line count. All variable texts must have the same line count.
ar: بعض ملفات المصدر لديها عدد أسطر مختلف عن عدد الأسطر في ملفات المصدر الأخرى، يجب أن يكون عدد الأسطر في كل الملفات متساو.

source: Base file name must not be empty.
ar: يجب أن يكون اسم الملف الأساسي غير فارغ

source: Background Color
ar: لون الخلفية

source: Background Image
ar: صورة الخلفية

source: Remove Background Image
ar: إزالة صورة الخلفية

source: Process Ended
ar: انتهت المعالجة

source: Capturing Started
ar: تم بدء التقاط الشاشة

source: Reading Text Files
ar: جار قراءة ملفات

source: Capturing
ar: جار التقاط الشاشة

source: Resizing
ar: جار تغيير حجم الصورة

source: Resizing Image
ar: جار تغيير حجم الصورة

source: Saving Images
ar: جار حفظ الصور

source: Valid
ar: صالح

source: Idle
ar: متوقف

source: Reading Data
ar: جار قراءة البيانات

source: Validating Read Data
ar: جار التحقق من صحة البيانات المقروءة

source: Saving Data
ar: جار حفظ البيانات

# openGeneratedImagesFolderPrompt
source: Images generated successfully, do you want to open generated images folder?
ar: تم توليد الصور بنجاح، هل تريد فتح مجلد الصور؟

source: Yes
ar: نعم

source: No
ar: لا

source: Image
ar: صورة

# ofString
source: of
ar: من

source: Progress
ar: حالة التقدم
